# نستقبل الرقمين من المستخدم 

print ("الالة الحاسبة التفاعلية".center(4)[::-1])
print ("ادخل حرف h لاظهار المساعده"[::-1])
print ("ادخل حرف q للخروج"[::-1])
help ="""
الاصدار الثاني من الالة الحاسبة 
يجب اذخال قيما عددية صحيحة ثم اختيار رقمالعملية
: انواع العمليات الرياضية
1 رقم عملية الجمع
2 رقم عملية الطرح
3 رقم عملية القسمة
4 رقم عملية الضرب
يمكنك ايضا كتابة احدالحروف 
h لاظهار هذه المساعدة 
q للخروج من الالة الحاسبة
"""
while True:
	num1 = input(" :ادخل الرقم الاول"[::-1]) # ملاحظة : لقد وضعت [::-1]حتى ياتي النص مكتوبا من اليمين الى اليسار لاني استخدم ترمكس لتنفيذ الاكوادا يعني ترمكس لا يمكنني قراءة النص بشكل العربي 
	if num1 =="q":
		print("شكرا لستخدامك الالة الحاسبة التفاعلية خروج"[::-1])
		break
	if num1 =="h":
		h_l = help.splitlines()
		for i in h_l:
			print(i[::-1])
		continue
	num2 = input(" :ادخل الرقم الثاني"[::-1]) # الرقم الثاني
# شرط اذا لم تكن القيم ارقامة تجاهل باقي الكود وبدا بدورة جديدة
	if not(num1.isdigit() and num2.isdigit()):
		print("ادخل قيما عددية رج"[::-1])
		continue
	else: # اما اذا كانت القيم ارقاما نفذ باقي الكود
		num1 , num2 = int(num1),int(num2)
		while True:
			print ("""
للجمع [1]
لطرح [2]
للقسمة[3]
للضرب [4]
"""[::-1]) #نص لتعليم المستخدم بارقام العمليات
			type_method = input("ادخل رقم العملية"[::-1]) #تحديد نوع العملية 
			if type_method == "1": #تحديد حالة الجمع
				print (f"{num1}+{num2}={num1+num2}")
				break
			elif type_method == "2": #تحديد حالة الطرح
				print (f"{num1}-{num2}={num1-num2}")
				break
			elif type_method == "3": # تحديد حالة القسمة
				print (f"{num1}÷{num2}={num1/num2}")
				break
			elif type_method == "4": # تحديد حالة الضرب
				print (f"{num1}x{num2}= {num1*num2}")
				break
			else:
				print ("ادخل رقم العملية الصحيح)1-4("[::-1])
