# نستقبل الرقمين من المستخدم 

print ("الالة الحاسبة الصغيرة".center(4)[::-1])

num1 = float(input(" :ادخل الرقم الاول"[::-1])) # ملاحظة : لقد وضعت [::-1]حتى ياتي النص مكتوبا من اليمين الى اليسار لاني استخدم ترمكس لتنفيذ الاكوادا يعني ترمكس لا يمكنني قراءة النص بشكل العربي 
num2 = float(input("ادخل الرقم الثاني"[::-1]))

print (f"{num1}+{num2}={num1+num2:.2f}") #جمع
print (f"{num1}-{num2}={num1-num2:.2f}") #طرح
print (f"{num1}÷{num2}={num1/num2:.3f}") #قسمة بثلاث منازل 
print (f"{num1}//{num2}={num1//num2:.2f}") # القسمة الصحيحة
print (f"{num1}×{num2}={num1*num2:.2f}") # الضرب 
print (f"{num1}**{num2}={num1**num2:.2f}") # الاقوة 
print (f"{num1}%{num2}={num1%num2:.2f}") # باقي القسمة

